app/Controllers/Invoice.php

SELECT *
FROM `products`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
---
      }
    }

    $data['products'] = $productModel->paginate(10);

SELECT *
FROM `discounts`
 LIMIT 1
---
    $data['sumData']  = $productModel->getSumData();

    $discountModel = new DiscountModel();
    $data['discountDetails'] = $discountModel->first();

SELECT *
FROM `discounts`
 LIMIT 1
INSERT INTO `discounts` (`discount_type`, `discount_amount`, `discounted_total`) VALUES ('fixed', '0.5', 50)
UPDATE `discounts` SET `discount_type` = 'percentage', `discount_amount` = '10', `discounted_total` = 45.45
WHERE `discounts`.`id` IN ('2')
---
  public function submitDiscount()
  {
    $postArray = $this->request->getPost();

    if (!empty($postArray['discountType']) && !empty($postArray['discountAmount'])) {
      if ($postArray['discountAmount'] > 0) {
        if ($postArray['discountType'] == 'percentage' && $postArray['discountAmount'] > 100) {
          $response['code'] = 400;
        } else {
          $productModel = new ProductModel();
          $sumData      = $productModel->getSumData();

          $totalAmount = $sumData['total_amount'];
          if ($postArray['discountType'] === 'percentage') {
            $totalAmount -= ($sumData['total_amount'] * $postArray['discountAmount'] / 100);
          } else {
            $totalAmount -= $postArray['discountAmount'];
          }

          $discountModel   = new DiscountModel();
          $discountDetails = $discountModel->first();
          if ($discountDetails) {
            $discountData['id'] = $discountDetails['id'];
          }

          $discountData['discount_type']    = $postArray['discountType'];
          $discountData['discount_amount']  = $postArray['discountAmount'];
          $discountData['discounted_total'] = $totalAmount;

          $discountModel->save($discountData);

SELECT *
FROM `products`
SELECT *
FROM `discounts`
 LIMIT 1
---
  public function generateInvoice()
  {
    $productModel = new ProductModel();
    $products     = $productModel->findAll();
    if (empty($products)) {
      $this->setMessage('No products added', 'info');
      return redirect()->to('/');
    }

    $data['products'] = $products;
    $data['sumData']  = $productModel->getSumData();

    $discountModel = new DiscountModel();
    $data['discountDetails'] = $discountModel->first();